CSI API ETABS v1
cPropMaterial.SetTemp Method
 assigns the temperatures at which properties are specified for a material. This data is required only for materials whose properties are temperature dependent.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTemp(
	string Name,
	int NumberItems,
	ref double[] Temp
)
Function SetTemp (
	Name As String,
	NumberItems As Integer,
	ByRef Temp As Double()
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim NumberItems As Integer
Dim Temp As Double()
Dim returnValue As Integer
returnValue = instance.SetTemp(Name, NumberItems,
	Temp)
int SetTemp(
	String^ Name,
	int NumberItems,
	array<double>^% Temp
)
abstract SetTemp :
        Name : string *
        NumberItems : int *
        Temp : float[] byref -> int
Parameters
Name
Type: System.String
The name of an existing material property.
NumberItems
Type: System.Int32
The number of different temperatures at which properties are specified for the material.
Temp
Type: System.Double[]
This is an array that includes the different temperatures at which properties are specified for the material.
Return Value
Type: Int32
Returns zero if the temperatures are successfully set; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'specify temps at which properties will be provided
       ReDim MyTemp(2)
       MyTemp(0) = 0
       MyTemp(1) = 50
       MyTemp(2) = 100
       ret = SapModel.PropMaterial.SetTemp("Steel", 3, MyTemp)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace